StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/axi/rtl8730aa_halmac.c
/******************************************************************************
 *
 * Copyright(c) 2015 - 2018 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTL8730AA_HALMAC_C_
#include <drv_types.h>		/* struct dvobj_priv and etc. */
#include "../../hal_halmac.h"
#include "../rtl8730a.h"	/* rtl8730a_get_tx_desc_size() */
#include "rtl8730aa.h"
#include "rtl8730a_xmit.h"
//#include "halmac_tx_desc_chip.h"

static u8 axi_write_port_not_xmitframe(void *d,  u32 size, u8 *pBuf,  u8 qsel)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	struct platform_device *pdev = pobj->pdev;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	u8 *txbd;
	dma_addr_t txbd_dma;
	u8 ret = _SUCCESS;
	dma_addr_t mapping;
	u16 tx_page_size = 128;
	u16 tx_page_used = 0;
	int i;

	/* map TX DESC buf_addr (including TX DESC + tx data) */
	mapping = dma_map_single(&pdev->dev, pBuf,
				 size + TX_WIFI_INFO_SIZE, DMA_TO_DEVICE);

	/* Calculate page size.
	 * Total buffer length including TX_WIFI_INFO and PacketLen */
	if (tx_page_size > 0) {
		tx_page_used = (size + TX_WIFI_INFO_SIZE) / tx_page_size;
		if (((size + TX_WIFI_INFO_SIZE) % tx_page_size) > 0) {
			tx_page_used++;
		}
	}

	txbd = dma_alloc_coherent(&pdev->dev, sizeof(struct tx_buf_desc), &txbd_dma, GFP_KERNEL);

	if (!txbd) {
		dma_unmap_single(&pdev->dev, mapping,
				 size + TX_WIFI_INFO_SIZE, DMA_FROM_DEVICE);

		return _FALSE;
	}
	/* BD init */
	if (qsel == HALMAC_TXDESC_QSEL_H2C_CMD) {
		rtw_write32(padapter, REG_H2CQ_TXBD_DESA,
			    txbd_dma & DMA_BIT_MASK(32));

		rtw_write32(padapter, REG_H2CQ_TXBD_NUM,
			    2 | ((RTL8730AA_SEG_NUM << 12) & 0x3000));

		/* Reset the H2CQ R/W point index to 0 */
		rtw_write32(padapter, REG_H2CQ_CSR,
			    rtw_read32(padapter, REG_H2CQ_CSR) | BIT8 | BIT16);
	} else {
		rtw_write32(padapter, REG_BCNQ_TXBD_DESA,
			    txbd_dma & DMA_BIT_MASK(32));
	}
	/*
	 * Reset all tx buffer desciprtor content
	 * -- Reset first element
	 */
	_rtw_memset(txbd, 0, sizeof(struct tx_buf_desc));

	/*
	 * Fill buffer length of the first buffer,
	 * For 8821ce, it is required that TX_WIFI_INFO is put in first segment,
	 * and the size of the first segment cannot be larger than
	 * TX_WIFI_INFO_SIZE.
	 */
	SET_TX_BD_TX_BUFF_SIZE0(txbd, TX_WIFI_INFO_SIZE);
	SET_TX_BD_PSB(txbd, tx_page_used);
	/* starting addr of TXDESC */
	SET_TX_BD_PHYSICAL_ADDR0_LOW(txbd, mapping);

	/*
	 * It is assumed that in linux implementation, packet is coalesced
	 * in only one buffer. Extension mode is not supported here
	 */
	SET_TXBUFFER_DESC_LEN_WITH_OFFSET(txbd, 1, size);
	/* don't using extendsion mode. */
	SET_TXBUFFER_DESC_AMSDU_WITH_OFFSET(txbd, 1, 0);
	SET_TXBUFFER_DESC_ADD_LOW_WITH_OFFSET(txbd, 1,
					      mapping + TX_WIFI_INFO_SIZE); /* pkt */

	wmb();

	if (qsel == HALMAC_TXDESC_QSEL_H2C_CMD) {
		rtw_write16(padapter, REG_H2CQ_TXBD_IDX, 1);
	} else {
		SET_TX_BD_OWN(txbd, 1);
		/* kick start */
		rtw_write32(padapter, REG_MGQ_TXBD_NUM_8730A,
			    rtw_read32(padapter, REG_MGQ_TXBD_NUM_8730A) |
			    BIT_PCIE_MGQ_FLAG_8730A);

		/* polling */
		for (i = 0; i < 100; i++) {
			u32 val;
			val = rtw_read32(padapter, REG_MGQ_TXBD_NUM_8730A);

			if (!(val & BIT_PCIE_MGQ_FLAG_8730A)) {
				RTW_DBG("%s BCN_FLAG ok i=%d\n", __func__, i);
				goto exit;
			}

			udelay(10);
		}
	}

	udelay(100);

exit:
	dma_free_coherent(&pdev->dev, sizeof(struct tx_buf_desc), txbd, txbd_dma);

	dma_unmap_single(&pdev->dev, mapping, size + TX_WIFI_INFO_SIZE,
			 DMA_FROM_DEVICE);

	return ret;
}

static u8 axi_write_data_not_xmitframe(void *d, u8 *pBuf, u32 size, u8 qsel)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	struct halmac_adapter *halmac = dvobj_to_halmac((struct dvobj_priv *)d);
	struct halmac_api *api = HALMAC_GET_API(halmac);
	struct hal_com_data *hal = GET_HAL_DATA(padapter);
	u32 desclen = 0;
	u8 pkt_offset = TX_DESC_PKT_OFFSET_8730A >> 3;
	u32 len = 0;
	u8 *buf = NULL;
	u8 ret = _FALSE;

	if (size + TXDESC_OFFSET > MAX_CMDBUF_SZ) {
		RTW_INFO("%s: total buffer size(%d) > MAX_CMDBUF_SZ(%d)\n",
			 __func__, size + TXDESC_OFFSET, MAX_CMDBUF_SZ);
		return _FALSE;
	}

	desclen = rtl8730a_get_tx_desc_size(padapter);
	len = desclen + size;

	buf = rtw_zmalloc(len);

	if (!buf) {
		RTW_ERR("%s: alloc buffer fail!\n", __func__);
		return _FALSE;
	}

	/* copy data */
	_rtw_memcpy(buf + desclen, pBuf, size);

	SET_TX_DESC_TXPKTSIZE_8730A(buf, size);

	/* TX_DESC is not included in the data,
	 * driver needs to fill in the TX_DESC with qsel=h2c
	 * Offset in TX_DESC should be set to 0.
	 */
	if (qsel == HALMAC_TXDESC_QSEL_H2C_CMD) {
		SET_TX_DESC_OFFSET_8730A(buf, 0);
	} else {
		SET_TX_DESC_OFFSET_8730A(buf, desclen);
	}

	SET_TX_DESC_PKT_OFFSET_8730A(buf, pkt_offset);

	SET_TX_DESC_QSEL_8730A(buf, qsel);

	api->halmac_fill_txdesc_checksum(halmac, buf);

	ret = axi_write_port_not_xmitframe(d, size, buf, qsel);

	if (ret == _SUCCESS) {
		ret = _TRUE;
	} else {
		ret = _FALSE;
	}

	rtw_mfree(buf, len);

	return _TRUE;
}

static u8 axi_write_data_rsvd_page_xmitframe(void *d, u8 *pBuf, u32 size)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	struct xmit_priv        *pxmitpriv = &padapter->xmitpriv;
	struct rtw_tx_ring *ring = &pxmitpriv->tx_ring[BCN_QUEUE_INX];
	struct platform_device *pdev = pobj->pdev;
	struct xmit_frame       *pcmdframe = NULL;
	struct xmit_buf       	*pxmitbuf = NULL;
	struct pkt_attrib       *pattrib = NULL;
	u32 desclen = 0;
	u8 *txdesc = NULL;
	u8 DLBcnCount = 0;
	u32 poll = 0;
	u8 *txbd;
	BOOLEAN bcn_valid = _FALSE;
	dma_addr_t mapping;

	if (size + TXDESC_OFFSET > MAX_CMDBUF_SZ) {
		RTW_INFO("%s: total buffer size(%d) > MAX_CMDBUF_SZ(%d)\n"
			 , __func__, size + TXDESC_OFFSET, MAX_CMDBUF_SZ);
		return _FALSE;
	}

	pcmdframe = rtw_alloc_cmdxmitframe(pxmitpriv);

	if (pcmdframe == NULL) {
		RTW_INFO("%s: alloc ReservedPagePacket fail!\n", __func__);
		return _FALSE;
	}

	pxmitbuf = pcmdframe->pxmitbuf;
	desclen = rtl8730a_get_tx_desc_size(padapter);
	txdesc = pcmdframe->buf_addr;

	_rtw_memcpy((txdesc + desclen), pBuf, size); /* shift desclen */

	/* update attribute */
	pattrib = &pcmdframe->attrib;
	update_mgntframe_attrib(padapter, pattrib);
	pattrib->qsel = QSLT_BEACON;
	pattrib->pktlen = size;
	pattrib->last_txcmdsz = size;

	/* Halmac does clear beacon valid check bit. */

	dump_mgntframe(padapter, pcmdframe);

	DLBcnCount = 0;
	poll = 0;
	do {
		DLBcnCount++;
		do {
			rtw_yield_os();
			/* does rsvd page download OK. */

			/* Don't use HW_VAR_BCN_VALID, because halmac always
			 * use Port 0 to send rsvd packets
			 */
			bcn_valid = rtw_read16(padapter, REG_DWBCN0_CTRL) &
				    BIT_BCN_VALID;
			poll++;
		} while (!bcn_valid && (poll % 10) != 0 && !RTW_CANNOT_RUN(padapter));
	} while (!bcn_valid && DLBcnCount <= 100 && !RTW_CANNOT_RUN(padapter));

	txbd = (u8 *)(&ring->buf_desc[0]);
	mapping = GET_TX_BD_PHYSICAL_ADDR0_LOW(txbd);
	dma_unmap_single(&pdev->dev, mapping, pxmitbuf->len, DMA_TO_DEVICE);

	return _TRUE;
}

static u8 axiwrite_data_h2c_normal(void *d, u8 *pBuf, u32 size)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	struct halmac_adapter *halmac = dvobj_to_halmac((struct dvobj_priv *)d);
	struct xmit_priv        *pxmitpriv = &padapter->xmitpriv;
	struct xmit_frame       *pcmdframe = NULL;
	struct pkt_attrib       *pattrib = NULL;
	struct halmac_api *api;
	u32 desclen;
	u8 pkt_offset = TX_DESC_PKT_OFFSET_8730A >> 3;
	u8 *buf;

	if (size + TXDESC_OFFSET > MAX_XMIT_EXTBUF_SZ) {
		RTW_INFO("%s: total buffer size(%d) > MAX_XMIT_EXTBUF_SZ(%d)\n"
			 , __func__, size + TXDESC_OFFSET, MAX_XMIT_EXTBUF_SZ);
		return _FALSE;
	}

	pcmdframe = alloc_mgtxmitframe(pxmitpriv);

	if (pcmdframe == NULL) {
		RTW_INFO("%s: alloc ReservedPagePacket fail!\n", __func__);
		return _FALSE;
	}

	api = HALMAC_GET_API(halmac);

	desclen = rtl8730a_get_tx_desc_size(padapter);
	buf = pcmdframe->buf_addr;
	_rtw_memcpy(buf + desclen, pBuf, size); /* shift desclen */

	SET_TX_DESC_TXPKTSIZE_8730A(buf, size);
	SET_TX_DESC_OFFSET_8730A(buf, 0);
	SET_TX_DESC_PKT_OFFSET_8730A(buf, pkt_offset);
	SET_TX_DESC_QSEL_8730A(buf, HALMAC_TXDESC_QSEL_H2C_CMD);
	SET_TX_DESC_TXDESC_CHECKSUM_8730A(buf, 0);
	api->halmac_fill_txdesc_checksum(halmac, buf);

	/* update attribute */
	pattrib = &pcmdframe->attrib;
	update_mgntframe_attrib(padapter, pattrib);
	pattrib->qsel = QSLT_CMD;
	pattrib->pktlen = size;
	pattrib->last_txcmdsz = size;

	/* fill tx desc in dump_mgntframe */
	dump_mgntframe(padapter, pcmdframe);

	return _TRUE;
}

static u8 axi_write_data_rsvd_page(void *d, u8 *pBuf, u32 size)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	u8 ret;

	if (pHalData->not_xmitframe_fw_dl) {
		ret = axi_write_data_not_xmitframe(d, pBuf, size, HALMAC_TXDESC_QSEL_BEACON);
	} else {
		ret = axi_write_data_rsvd_page_xmitframe(d, pBuf, size);
	}

	if (ret == _TRUE) {
		return 1;
	}
	return 0;
}

static u8 axiwrite_data_h2c(void *d, u8 *pBuf, u32 size)
{
	struct dvobj_priv *pobj = (struct dvobj_priv *)d;
	PADAPTER padapter = dvobj_get_primary_adapter(pobj);
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	u8 ret;

	if (pHalData->not_xmitframe_fw_dl) {
		ret = axi_write_data_not_xmitframe(d, pBuf, size, HALMAC_TXDESC_QSEL_H2C_CMD);
	} else {
		ret = axiwrite_data_h2c_normal(d, pBuf, size);
	}

	if (ret == _TRUE) {
		return 1;
	}
	return 0;
}

int rtl8730aa_halmac_init_adapter(PADAPTER padapter)
{
	struct dvobj_priv *d;
	struct halmac_platform_api *api;
	int err;
	u16 tmp;

	d = adapter_to_dvobj(padapter);
	api = &rtw_halmac_platform_api;
	api->SEND_RSVD_PAGE = axi_write_data_rsvd_page;
	api->SEND_H2C_PKT = axiwrite_data_h2c;

	err = rtw_halmac_init_adapter(d, api);

	return err;
}
